# Letnie igrzyska olimpijskie II

### 1.


Wczytaj tabelę z dokonaniami medalowymi 'summer_1976_2008.pkl'.Wczytaj tabelę z dokonaniami medalowymi 'summer_1976_2008.pkl'.# Letnie igrzyska olimpijskie II

In [1]:
import pandas as pd

In [20]:
olimp = pd.read_pickle("summer_1976_2008.pkl")

In [3]:
olimp.head(5)

,City,Year,Sport,Discipline,Event,Athlete,Gender,Country_Code,Country,Event_gender,Medal
0,Montreal,1976,Aquatics,Diving,3m springboard,"KÖHLER, Christa",Women,GDR,East Germany,W,Silver
1,Montreal,1976,Aquatics,Diving,3m springboard,"KOSENKOV, Aleksandr",Men,URS,Soviet Union,M,Bronze
2,Montreal,1976,Aquatics,Diving,3m springboard,"BOGGS, Philip George",Men,USA,United States,M,Gold
3,Montreal,1976,Aquatics,Diving,3m springboard,"CAGNOTTO, Giorgio Franco",Men,ITA,Italy,M,Silver
4,Montreal,1976,Aquatics,Diving,10m platform,"WILSON, Deborah Keplar",Women,USA,United States,W,Bronze

### 2.

Jakie kraje zdobyły medale na igrzyskach olimpijskich w Moskwie, ale nie wzięły udziału (lub nie zdobyły żadnych medali) podczas igrzysk olimpijskich w Los Angeles?

In [4]:
Moskwa = set(olimp[olimp.City == 'Moscow']['Country'].unique())
Los_Angeles = set(olimp[olimp.City == 'Los Angeles']['Country'].unique())

In [5]:
Moskwa - Los_Angeles

{'Bulgaria',
 'Cuba',
 'Czechoslovakia',
 'East Germany',
 'Ethiopia',
 'Guyana',
 'Hungary',
 'India',
 'Korea, North',
 'Lebanon',
 'Mongolia',
 'Poland',
 'Soviet Union',
 'Tanzania',
 'Uganda',
 'Zimbabwe'}

In [9]:
moscow = set(olimp[olimp.City == 'Moscow']['Country'].unique())
los_angeles = set(olimp[olimp.City == 'Los Angeles']['Country'].unique())
moscow
los_angeles
moscow-los_angeles

{'Bulgaria',
 'Cuba',
 'Czechoslovakia',
 'East Germany',
 'Ethiopia',
 'Guyana',
 'Hungary',
 'India',
 'Korea, North',
 'Lebanon',
 'Mongolia',
 'Poland',
 'Soviet Union',
 'Tanzania',
 'Uganda',
 'Zimbabwe'}

### 3.

Wyświetl wszystkich sportowców, którzy zdobyli medale na pięciu lub więcej olimpiadach.

In [21]:
olimp.head()

,City,Year,Sport,Discipline,Event,Athlete,Gender,Country_Code,Country,Event_gender,Medal
0,Montreal,1976,Aquatics,Diving,3m springboard,"KÖHLER, Christa",Women,GDR,East Germany,W,Silver
1,Montreal,1976,Aquatics,Diving,3m springboard,"KOSENKOV, Aleksandr",Men,URS,Soviet Union,M,Bronze
2,Montreal,1976,Aquatics,Diving,3m springboard,"BOGGS, Philip George",Men,USA,United States,M,Gold
3,Montreal,1976,Aquatics,Diving,3m springboard,"CAGNOTTO, Giorgio Franco",Men,ITA,Italy,M,Silver
4,Montreal,1976,Aquatics,Diving,10m platform,"WILSON, Deborah Keplar",Women,USA,United States,W,Bronze

In [22]:
o = olimp.loc[:, ['Athlete', 'Year']]
o

                        Athlete  Year
0               KÖHLER, Christa  1976
1           KOSENKOV, Aleksandr  1976
2          BOGGS, Philip George  1976
3      CAGNOTTO, Giorgio Franco  1976
4        WILSON, Deborah Keplar  1976
...                         ...   ...
15428        GUENOT, Christophe  2008
15429       KVIRKELIA, Manuchar  2008
15430          RAHIMOV, Vitaliy  2008
15431            GUENOT, Steeve  2008
15432             LOPEZ, Mijain  2008

[15316 rows x 2 columns]

In [23]:
o.drop_duplicates(inplace=True)
o

                        Athlete  Year
0               KÖHLER, Christa  1976
1           KOSENKOV, Aleksandr  1976
2          BOGGS, Philip George  1976
3      CAGNOTTO, Giorgio Franco  1976
4        WILSON, Deborah Keplar  1976
...                         ...   ...
15428        GUENOT, Christophe  2008
15429       KVIRKELIA, Manuchar  2008
15430          RAHIMOV, Vitaliy  2008
15431            GUENOT, Steeve  2008
15432             LOPEZ, Mijain  2008

[13909 rows x 2 columns]

In [24]:
o[o.Athlete == 'TORRES, Dara']

            Athlete  Year
2896   TORRES, Dara  1984
4304   TORRES, Dara  1988
5900   TORRES, Dara  1992
9431   TORRES, Dara  2000
13480  TORRES, Dara  2008

In [25]:
o = o.Athlete.value_counts()

In [26]:
o

Athlete
FISCHER, Birgit       6
LIPA, Elisabeta       6
IDEM, Josefa          5
KARSTEN, Ekaterina    5
TRILLINI, Giovanna    5
                     ..
NISIMA, Maureen       1
WU, Hanxiong          1
VANNI, Simone         1
MOLTCHAN, Youri       1
LOPEZ, Mijain         1
Name: count, Length: 11337, dtype: Int64

In [27]:
o[o >= 5]

Athlete
FISCHER, Birgit        6
LIPA, Elisabeta        6
IDEM, Josefa           5
KARSTEN, Ekaterina     5
TRILLINI, Giovanna     5
REDGRAVE, Steven       5
KOLOBKOV, Pavel        5
GEORGESCU, Elena       5
GRAEL, Torben          5
SAUTIN, Dmitry         5
TORRES, Dara           5
IGNAT, Doina           5
BORON, Kathrin         5
EDWARDS, Teresa        5
VAN GRUNSVEN, Anky     5
WANG, Yifu             5
BURCICA, Constanta     5
TANI, Ryoko            5
SCHUMANN, Ralf         5
OTTEY-PAGE, Merlene    5
Name: count, dtype: Int64

In [10]:
# 2 rozwiazanie

### 4.

Wyświetl wszystkich sportowców, którzy zdobyli medale w sześciu lub więcej konkurencjach medalowych.

### 5.
**5 punktów**

Wyświetl wszystkich sportowców, którzy zdobyli medale w dwóch różnych kategoriach *Sport*. Czy którekolwiek ze znalezionych nazwisk faktycznie reprezentuje jedną osobę? Da się to potwierdzić bazą?

### 6.

Utwórz wykres słupkowy pokazujący, ilu Polaków stanęło na podium podczas poszczególnych edycji igrzysk. Słupki ustaw w kolejności chronologicznej. Uwzględnij **wszystkie** olimpiady z bazy.

### 7.

To samo co w punkcie 6., ale tym razem nad każdą edycją powinny znajdować się trzy słupki odpowiadające trzem rodzajom medali. Zadbaj, aby srebro było słupkiem środkowym.

### 8.

Z punktu 5. wynika, że podczas igrzysk w Montrealu na podium stanęło 73 Polaków. Jednak wg. [Wikipedii](https://pl.wikipedia.org/wiki/Letnie_Igrzyska_Olimpijskie_1976#Statystyka_medalowa) statystyka medalowa z tej olimpiady dla Polski to: złoto - 7, srebro - 6, brąz - 13, co daje zaledwie 26 medali. Dlaczego? Jak liczone są osiągnięcia medalowe dla krajów?

Utwórz ramkę, w której zamieścisz oficjalne statystyki medalowe dla Polski dla wszystkich (poza edycją z roku 1984) igrzysk z bazy. W ramce:
* wiersze to edycje olimpiady;
* cztery kolumny odpowiadają wartościom: liczba złotych, srebrnych, brązowych medali i ich suma.

Przykładowo, wiersz dla igrzysk z 1976 roku powinien mieć wartości 7, 6, 13, 26.

Czy udało Ci się uzyskać pełną zgodność ze statystykami opublikowanymi na [Wikipedii](https://pl.wikipedia.org/wiki/Kategoria:Klasyfikacja_medalowa_letnich_igrzysk_olimpijskich)? Jeśli nie, to napisz co jest tego powodem.

Na podstawie ramki z tego punktu utwórz wykres słupkowy z **poziomymi** słupkami. Dla danej edycji trzy słupki powinny odpowiadać trzem rodzajom medali. Dostosuj rozmiar rysunku.

### 9.

Wykorzystaj bazę do utworzenia ramki z klasyfikacją medalową dla igrzysk z Montrealu. Klasyfikacja powinna wyglądać tak jak na [tej stronie](https://pl.wikipedia.org/wiki/Klasyfikacja_medalowa_Letnich_Igrzysk_Olimpijskich_1976) Wikipedii. Państwa mogą znajdować się w indeksie, liczbę porządkową możesz pominąć, ale zachowaj kolejność.

Na podstawie ramki z tego punktu utwórz wykres słupkowy osiągnięć medalowych dla dwudziestu pierwszych krajów z tabeli. Znów każdy kraj powinien mieć trzy słupki odpowiadające trzem rodzajom medali. Słupki powinny być **pionowe**. Sprawdź, do czego służy parametr `rot` w metodzie `.plot()`. Wykorzystaj go, aby zwiększyć czytelność. Dostosuj rozmiar rysunku.